let bangumi_group_name = [
    '週日（日）',
    '週一（月）',
    '週二（火）',
    '週三（水）',
    '週四（木）',
    '週五（金）',
    '週六（土）',
    '非週更'
];
let bangumi_data = [
    [
        ["00.00.偶像集结", "UniteUp"],
        ["00.30.尼尔：自动人形 Ver1.1a", "尼尔"],
        ["01.00.蓝色监狱","蓝色监狱"],
        ["01.00.最强阴阳师的异世界转生记", "最强阴阳师"],
        ["01.00.不要欺负我，长瀞同学 第二季", "长瀞同学"],
        ["01.00.魔王学院的不适任者 第二季", "魔王学院"],
        ["01.08.东京复仇者 第二季", "东京复仇者"],
        ["03.00.为了养老金去异世界存八万金", "养老金"],
        ["07.30.开阔天空！光之美少女", "光之美少女"],
        ["09.30.数码宝贝幽灵游戏", "数码宝贝"],
        ["10.30.海贼王"],
        ["17.30.博人传 火影忍者新时代","博人传"],
        ["21.00.沦落者之夜", "沦落者之夜"],
        ["21.30.被神捡到的男人 第二季", "神捡 男"],
        ["21.30.斋藤先生无所不能", "斋藤"],
        ["23.05.虚构推理 第二季", "虚构推理"],
        ["24.00.英雄传说 闪之轨迹：北方战役", "闪之轨迹"],
        ["怪兽档案 第二季", "KJ FILE"]
    ],
    [
        ["00.00.Show Time！唱歌的大姐姐也想做 2期", "Show Time"],
        ["01.00.我与机器子", "我与机器"],
        ["01.35.再得一胜！", "再得一胜"],
        ["10.45.豆吉豆子的家里蹲日常", "家里蹲|尼特|neet"],
        ["18.00.致不灭的你 第二季", "致不灭的你"],
        ["19.00.飙速宅男 第五季", "飙速宅男"],
        ["19.00.至高之牌 HIGH CARD", "HIGH CARD"],
        ["21.35.吸血鬼马上死 第二季", "吸血鬼马上死"],
        ["23.30.冰海战记 第二季", "冰海战记"]
    ],
    [
        ["00.30.物之古物奇谭", "物之古物奇谭|物物语"],
        ["00.35.FLAGLIA"],
        ["01.15.英雄王 为了穷尽武道而转生", "英雄王"],
        ["01.20.永久少年", "永久少年"],
        ["01.30.呆萌酷男孩"],
        ["01.30.妖幻三重奏"],
        ["22.30.冰属性男子与酷酷女同事", "冰属性男子"],
        ["22.35.不相信人类的冒险者们好像要去拯救世界", "不相信人"],
        ["23.30..久保同学不放过我", "久保同学"]
    ],
    [
        ["00.00.拥有超常技能的异世界流浪美食家", "技能 异世界 美食"],
        ["00.00.埃及神明们的日常 第二季", "埃及神明"],
        ["20.30.魔术士奥芬的无赖之旅 拉玛城篇", "魔术士奥芬"],
        ["21.00.转生王女与天才千金的魔法革命", "魔法革命"],
        ["22.00.文豪野犬 第四季", "文豪野犬"],
        ["22.30.想要成为影之实力者！", "影之实力者"],
        ["23.00.超技舞台", "超技舞台|OVERMIND"],
        ["23.30.因为太怕痛就全点防御力了。 2期", "怕痛"]
    ],
    [
        ["00.00.弦音 -联系的一箭-", "弦音"],
        ["01.00.关于养猫我一直是新手"],
        ["01.00.智酱是女生", "智 女"],
        ["01.25.大雪海的凯纳", "大雪海"],
        ["20.00.复仇者", "复仇者|REVENGER"],
        ["20.00.生而为狗 我很幸福", "变成狗"],
        ["21.30.间谍教室"],
        ["22.00.期待在地下城邂逅有错吗 Ⅳ 深章 灾厄篇", "地下城邂逅"],
        ["22.30.不当哥哥了！", "当哥哥了|当欧尼酱了"],
        ["23.00.舰队Collection 总有一天，在那片海", "Collection"]
    ],
    [
        ["00.45.福星小子", "福星小子"],
        ["00.58.冰剑的魔术师将要统一世界", "冰剑 魔"],
        ["17.55.宝可梦 旅途 目标是宝可梦大师"],
        ["20.00.异世界悠闲农家", "异世界 农家"],
        ["20.35.银砂糖师与黑色妖精", "砂糖 妖精"],
        ["20.54.虹四动画", "虹四|虹团|虹咲四"],
        ["21.00.百万吨级武藏 第2季", "百万吨级武藏"],
        ["22.00.D4DJ All Mix","D4DJ All Mix"],
        ["23.00.杀手奶爸 Buddy Daddies ", "Buddy Daddies"]
    ],
    [
        ["00.23.进化之实 踏上胜利的人生 第二季", "进化之实"],
        ["00.55.阿鲁斯的巨兽"],
        ["01.55.反派大小姐莉泽洛特与实况解说", "解说员小林"],
        ["07.00.卡片战斗先导者 will+Dress 2期", "卡片战斗先导者"],
        ["09.00.影之诗F"],
        ["15.30.蜡笔小新"],
        ["16.00.哆啦A梦"],
        ["17.00.名侦探柯南"],
        ["17.30.我的英雄学院 第六季", "英雄学院"],
        ["19.00.入间同学入魔了 第三季", "入间同学入魔了"],
        ["21.00.被解雇的暗黑士兵（30多岁）慢活的第二人生", "暗黑士兵"],
        ["21.30.狩火之王"],
        ["23.00.邻家的天使同学", "邻家 天使"],
        ["23.30.枪神 斯坦比特", "TRIGUN STAMPEDE"]
    ],
    [
        ["终末的女武神 2期 前篇", "终末的女武神"],
        ["冰雪极境", "MAKE MY DAY"],
        ["极主夫道 第二季", "极主夫道"],
        ["看脸时代", "Lookism"],
        ["伊藤润二《狂热集》", "伊藤润二"],
        ["女校之星"],
        ["职场小烈 5期", "小烈|烈子"],
        ["鲁邦三世 VS 猫眼三姐妹"]
    ]
];